name: "vision_model"
platform: "onnxruntime_onnx"
max_batch_size: 32

input [
  {
    name: "input_image"
    data_type: TYPE_FP32
    format: FORMAT_NCHW
    dims: [3, 224, 224]
  }
]

output [
  {
    name: "embedding"
    data_type: TYPE_FP32
    dims: [512]
  }
]